var cga = require('../cgaapi')(function(){

	cga.travel.falan.toStone('C', ()=>{
		cga.walkList([
			[27, 82],
			[41,98,'法兰城'],
			[281, 88, '芙蕾雅'],
			[672,223,'哈巴鲁东边洞穴 地下1楼'],
			[41,8,'哈巴鲁东边洞穴 地下2楼'],
			[17,18]
			], ()=>{
				cga.ForceMove(6, true);
				cga.ForceMove(6, true);
				cga.walkList([
					[16,11,'哈巴鲁东边洞穴 地下1楼'],
					[30,4,'芙蕾雅'],
					[596,84,'亚留特村'],
					[49,65],[49,47],
					[56,48,2412],
					[22,9,2499],
					[5,13],[4,14],[5,13],[4,14],[5,13]
					], ()=>{
						cga.turnTo(5, 14);
					});
			});
	});
});